/*
*   Класс: org.sheart.mpanzer.particle.Particle
*   Описание:
*       Класс является родителем для всех классов частиц, игровых объектов, ис-
*       пользуемых для повышения визуального качества проекта. Частицы, возник-
*       шие за пределами поля зрения игрока, мгновенно удаляются. Это свойство
*       не позволяет использовать частицы как важный элемент, от которого зави-
*       сит ход игры.
*   ____________________________________________________________________________
*   Проект "Mission „Panzer“" лицензирован под BSD-3 License, ознакомиться с ко-
*   торой можно в корне проекта, она изложена в файле "license.txt".
*   Русскоязычная адаптация также находится в корне, в файле "license_rus.txt",
*   и использует кодировку UTF-8.
*   Разработчиком проекта является Yew_Mentzaki. Список всех контрибьюторов мож-
*   но увидеть в корне проекта, в файле "contributors.txt".
*/

package org.sheart.mpanzer.game.particle;

/**
 *
 * @author yew_mentzaki
 */
public class Particle {
    
}
